#language: ru

@tree


Функционал: Дозагрузка Характеристик

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание объектов для справочника ЗначенияХарактеристик

	И я проверяю или создаю для справочника "ЗначенияХарактеристик" объекты:
		| 'Ссылка'                                                                           | 'ПометкаУдаления' | 'Владелец'                                                                                 | 'Код'       | 'Наименование' |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=81248000600fe80011df45fdcbdd0628' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | '000000017' | 'Резина'       |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=81248000600fe80011df45fdcbdd0629' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | '000000018' | 'Войлок'       |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710084' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | '000000005' | 'Кожа'         |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710085' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | '000000006' | 'Дермантин'    |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008c' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | '000000012' | '3,2'          |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008d' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | '000000013' | '3,5'          |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca2000d8843cd1b11dc910e5100d886' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca2000d8843cd1b11dc910e5100d885' | '000000014' | '320'          |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab1' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab0' | '000000015' | 'Сутки'        |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab4' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab3' | '000000016' | 'Неделя'       |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4228' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | '000000002' | 'Красный'      |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4229' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | '000000003' | 'Зеленый'      |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422a' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | '000000001' | 'Синий'        |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=bc070050ba5c887711e29c578feeb1c7' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | '000000019' | 'Бронзовый'    |
		| 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=bc070050ba5c887711e29c578feeb1c8' | 'False'           | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | '000000020' | '15'           |

Сценарий: Создание объектов для плана видов характеристик ВидыХарактеристик

	И я проверяю или создаю для плана видов характеристик "ВидыХарактеристик" объекты:
		| 'Ссылка'                                                                                   | 'ПометкаУдаления' | 'Код'       | 'Наименование'        | 'Назначение'                               |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=81248000600fe80011df45fdcbdd0627' | 'False'           | '000000009' | 'Размер по диагонали' | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | 'False'           | '000000003' | 'Материал'            | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | 'False'           | '000000004' | 'Жирность'            | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca2000d8843cd1b11dc910e5100d885' | 'False'           | '000000005' | 'Мощность'            | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab0' | 'False'           | '000000006' | 'Срочная'             | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8d3a000d8843cd1b11dd321ba7a30ab3' | 'False'           | '000000007' | 'Стандартный'         | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a05500195b8648b611df3d8facd8fca4' | 'False'           | '000000008' | 'Директор'            | 'Enum.НазначениеХарактеристик.Контрагенты' |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 'False'           | '000000001' | 'Цвет'                | 'Enum.НазначениеХарактеристик.Товары'      |
		| 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422b' | 'False'           | '000000002' | 'Размер'              | 'Enum.НазначениеХарактеристик.Товары'      |


	// РегистрСведений.Характеристики

	И я проверяю или создаю для регистра сведений "Характеристики" записи:
		| 'Объект'                                                            | 'ВидХарактеристики'                                                                        | 'Значение'                                                                         |
		| 'e1cib/data/Справочник.Товары?ref=8d40000d8843cd1b11dd3de2bb0c7537' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=81248000600fe80011df45fdcbdd0627' | 58                                                                                 |
		| 'e1cib/data/Справочник.Товары?ref=8ca2000d8843cd1b11dc9111f169782e' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008d' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db8c51bbb079af' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=bc070050ba5c887711e29c578feeb1c7' |
		| 'e1cib/data/Справочник.Товары?ref=a9b200055d49b45e11db9b1315c596e3' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4228' |
		| 'e1cib/data/Справочник.Товары?ref=a9b200055d49b45e11db9b1315c596e3' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=81248000600fe80011df45fdcbdd0629' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db8c51bbb079af' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710082' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d710084' |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df4' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008d' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db8c51bbb079af' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422b' | 38                                                                                 |

	

